
print("Hello")



'''
1) Установите Python.
2) Установите PyCharm.
3) Создайте проект в PyCharm.
4) Создайте Python-файл и напишите в нём: print('Hello')
5) Запустите данный скрипт и убедитесь, что он работает.
'''