
array1 = list(range(1, 5))
array2 = [10, 15, 25, 50, 100]

x1 = 0
for i in array1:
    x1 += i
print(x1)
print(x1 / len(array1))

print("---------------")

x2 = 0
for i in array2:
    x2 += i
print(x2)
print(x2 / len(array2))



'''
1) Создайте список из 5 чисел.
2) Определите сумму чисел в списке и выведите её.
3) Определите среднее арифметическое чисел в списке и выведите его.

Примечание: при выполнении заданий используйте цикл for.
'''