
inputValue = input("Введите любую строку: ")
tupleValue = tuple(inputValue)
print(tupleValue)
for i in tupleValue:
    print(i)




'''
1) Попросите пользователя ввести произвольную строку.
2) Создайте кортеж, состоящий из символов, введённой пользователем строки.
3) Выведите кортеж, используя цикл for.
'''