import Lesson_16___MyModule

print(Lesson_16___MyModule.maxArr(1, 2, 3, 4, 5))
print(Lesson_16___MyModule.minArr(1, 2, 3, 4, 5))
print(Lesson_16___MyModule.sumArr(1, 2, 3, 4, 5))




'''
1) Создайте свой модуль и подключите его в основном файле.
2) Напишите в модули 3 функции, каждая из которых принимает список. Первая функция – получение максимального значения, вторая – получение минимального значения, третья – получение суммы всех элементов.
3) Проверьте работу этих функций в основном файле.
'''