
def negativeNumbers (*numbers):
    for i in numbers:
        if i < 0:
            print(i)

print(negativeNumbers(1, -1, 2, -2, 3, -3))




'''
1) Создайте список из 5 чисел.
2) Напишите функцию, которая находит все отрицательные числа и выводит их.
3) С помощью отладки пройдите все шаги выполнения программы, анализируя значения всех переменных.
'''